# SetSuperscriptStatus Method (Boolean) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..SetSuperscriptStatus Method (Boolean)
FormattedText Class See Also
---
Sets the characters in the entire text to be superscript or not superscript.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetSuperscriptStatus(
	bool isSuperscript
)
```

Visual Basic
---
```text
Public Sub SetSuperscriptStatus ( _
	isSuperscript As Boolean _
)
```

Visual C++
---
```text
public:
void SetSuperscriptStatus(
	bool isSuperscript
)
```

# ### Parameters
isSuperscript
    Type: System..::..Boolean The desired superscript status of characters in the entire text. True to set superscript, false to set not superscript.
# Remarks
If the characters are set to be superscript, they cannot be subscript. This sets the subscript status to false.
# See Also
FormattedText Class
SetSuperscriptStatus Overload
Autodesk.Revit.DB Namespace